/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ikota <ikota@student.42tokyo.jp>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/10/01 16:33:34 by ikota             #+#    #+#             */
/*   Updated: 2026/10/01 16:37:02 by ikota            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <iostream>

int main(void) {
	int a = 2;
	int b = 3;
	::swap(a, b);
	std::cout << "a = " << a << ", b = " << b << std::endl;
	std::cout << "min( a, b ) = " << ::min( a, b ) << std::endl;
	std::cout << "max( a, b ) = " << ::max( a, b ) << std::endl;

	std::string c = "chaine1";
	std::string d = "chaine2";

	::swap(c, d);
	std::cout << "c = " << c << ", d = " << d << std::endl;
	std::cout << "min( c, d ) = " << ::min( c, d ) << std::endl;
	std::cout << "max( c, d ) = " << ::max( c, d ) << std::endl;

	return 0;
}

// 以下の関数テンプレートを実装してください：
// • swap：2つの指定されたパラメータの値を交換する。戻り値はない。
// • min：パラメータとして渡された2つの値を比較し、小さい方の値を返す。
// 値が等しい場合は、2番目の値を返す。
// • max：パラメータとして渡された2つの値を比較し、大きい方の値を返す。
// 値が等しい場合は、2番目の値を返す。
// これらの関数は、任意の型の引数で呼び出すことができる。唯一の要件は、
// 2つの引数が同じ型であり、すべての比較演算子をサポートしていることである。
