/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   Array.hpp                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ikota <ikota@student.42tokyo.jp>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/10/01 19:28:18 by ikota             #+#    #+#             */
/*   Updated: 2026/10/01 19:31:14 by ikota            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef EX02_ARRAY_HPP_
#define EX02_ARRAY_HPP_



#endif

// 型 T の要素を格納し、以下の動作と関数を実装するクラステンプレート Array を設計してください：
// • パラメータなしのコンストラクタ：空の配列を作成します。
// • unsigned int n をパラメータとするコンストラクタ：デフォルト値で初期化された n 個の要素からなる配列を作成します。
// ヒント：int * a = new int(); とコンパイルした後、*a を表示してみてください。
// • コピーコンストラクタと代入演算子による初期化。どちらの場合も、元の配列またはそのコピーをコピー後に変更しても、
// 	他の配列に影響を与えてはなりません。
// • メモリ割り当てには必ず operator new[] を使用してください。事前割り当て（メモリを事前に確保すること）は禁止です。
// 	プログラムは未割り当てメモリにアクセスしてはなりません。
// • 要素には添字演算子 [] を使用してアクセスできます。
// • [] 演算子で要素にアクセスする際、インデックスが範囲外の場合、std::exception がスローされます。
// • 配列内の要素数を返すメンバー関数 size()。このメンバー関数はパラメータを取らず、現在のインスタンスを変更しないようにしてください。

// 通常どおり、すべてが期待通りに動作することを確認し、テストコードを含む main.cpp ファイルを提出してください。
